Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70b/atdf/ATSAME70J20B.atdf
        <module name="AES" id="6149" version="W">
          <instance name="AES">
            <register-group address-space="base" name="AES" name-in-module="AES" offset="0x4006C000"/>
            <parameters>
              <param name="DMAC_ID_TX" value="37"/>
              <param name="DMAC_ID_RX" value="38"/>
              <param name="INSTANCE_ID" value="56"/>
              <param name="CLOCK_ID" value="56"/>
            </parameters>
          </instance>
        </module>
        <module name="AFEC" id="11147" version="S">
          <instance name="AFEC0">
            <register-group address-space="base" name="AFEC0" name-in-module="AFEC" offset="0x4003C000"/>
            <signals>
              <signal pad="PA8" function="B" group="ADTRG"/>
              <signal pad="PD30" function="X1" group="AD" index="0"/>
              <signal pad="PA21" function="X1" group="AD" index="1"/>
              <signal pad="PA21" function="X1" group="PIODCEN" index="2"/>
              <signal pad="PB3" function="X1" group="AD" index="2"/>
              <signal pad="PB3" function="X1" group="WKUP" index="12"/>
              <signal pad="PE5" function="X1" group="AD" index="3"/>
              <signal pad="PE4" function="X1" group="AD" index="4"/>
              <signal pad="PB2" function="X1" group="AD" index="5"/>
              <signal pad="PA17" function="X1" group="AD" index="6"/>
              <signal pad="PA18" function="X1" group="AD" index="7"/>
              <signal pad="PA19" function="X1" group="AD" index="8"/>
              <signal pad="PA19" function="X1" group="WKUP" index="9"/>
              <signal pad="PA20" function="X1" group="AD" index="9"/>
              <signal pad="PA20" function="X1" group="WKUP" index="10"/>
              <signal pad="PB0" function="X1" group="AD" index="10"/>
              <signal pad="PB0" function="X1" group="RTCOUT" index="0"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="35"/>
              <param name="INSTANCE_ID" value="29"/>
              <param name="CLOCK_ID" value="29"/>
            </parameters>
          </instance>
          <instance name="AFEC1">
            <register-group address-space="base" name="AFEC1" name-in-module="AFEC" offset="0x40064000"/>
            <signals>
              <signal pad="PD9" function="C" group="ADTRG"/>
              <signal pad="PB1" function="X1" group="AD" index="0"/>
              <signal pad="PB1" function="X1" group="RTCOUT" index="1"/>
              <signal pad="PC13" function="X1" group="AD" index="1"/>
              <signal pad="PC15" function="X1" group="AD" index="2"/>
              <signal pad="PC12" function="X1" group="AD" index="3"/>
              <signal pad="PC29" function="X1" group="AD" index="4"/>
              <signal pad="PC30" function="X1" group="AD" index="5"/>
              <signal pad="PC31" function="X1" group="AD" index="6"/>
              <signal pad="PC26" function="X1" group="AD" index="7"/>
              <signal pad="PC27" function="X1" group="AD" index="8"/>
              <signal pad="PC0" function="X1" group="AD" index="9"/>
              <signal pad="PE3" function="X1" group="AD" index="10"/>
              <signal pad="PE0" function="X1" group="AD" index="11"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="36"/>
              <param name="INSTANCE_ID" value="40"/>
              <param name="CLOCK_ID" value="40"/>
            </parameters>
          </instance>
        </module>
        <module name="CHIPID" id="6417" version="ZK">
          <instance name="CHIPID">
            <register-group address-space="base" name="CHIPID" name-in-module="CHIPID" offset="0x400E0940"/>
          </instance>
        </module>
        <module name="DACC" id="11246" version="D">
          <instance name="DACC">
            <register-group address-space="base" name="DACC" name-in-module="DACC" offset="0x40040000"/>
            <signals>
              <signal pad="PB13" function="X1" group="DAC" index="0"/>
              <signal pad="PD0" function="X1" group="DAC" index="1"/>
              <signal pad="PA2" function="C" group="DATRG"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="30"/>
              <param name="INSTANCE_ID" value="30"/>
              <param name="CLOCK_ID" value="30"/>
            </parameters>
          </instance>
        </module>
        <module name="EFC" id="6450" version="X">
          <instance name="EFC">
            <register-group address-space="base" name="EFC" name-in-module="EFC" offset="0x400E0C00"/>
            <parameters>
              <param name="FLASH_SIZE" value="1048576"/>
              <param name="PAGE_SIZE" value="512"/>
              <param name="INSTANCE_ID" value="6"/>
              <param name="PAGES_PR_REGION" value="32"/>
            </parameters>
          </instance>
        </module>
        <module name="GMAC" id="11046" version="S">
          <instance name="GMAC">
            <register-group address-space="base" name="GMAC" name-in-module="GMAC" offset="0x40050000"/>
            <signals>
              <signal pad="PD13" function="A" group="GCOL"/>
              <signal pad="PD10" function="A" group="GCRS"/>
              <signal pad="PD8" function="A" group="GMDC"/>
              <signal pad="PD9" function="A" group="GMDIO"/>
              <signal pad="PD14" function="A" group="GRXCK"/>
              <signal pad="PD4" function="A" group="GRXDV"/>
              <signal pad="PD7" function="A" group="GRXER"/>
              <signal pad="PD5" function="A" group="GRX" index="0"/>
              <signal pad="PD6" function="A" group="GRX" index="1"/>
              <signal pad="PD11" function="A" group="GRX" index="2"/>
              <signal pad="PD12" function="A" group="GRX" index="3"/>
              <signal pad="PB1" function="B" group="GTSUCOMP"/>
              <signal pad="PB12" function="B" group="GTSUCOMP"/>
              <signal pad="PD11" function="C" group="GTSUCOMP"/>
              <signal pad="PD20" function="C" group="GTSUCOMP"/>
              <signal pad="PD0" function="A" group="GTXCK"/>
              <signal pad="PD1" function="A" group="GTXEN"/>
              <signal pad="PD17" function="A" group="GTXER"/>
              <signal pad="PD2" function="A" group="GTX" index="0"/>
              <signal pad="PD3" function="A" group="GTX" index="1"/>
              <signal pad="PD15" function="A" group="GTX" index="2"/>
              <signal pad="PD16" function="A" group="GTX" index="3"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="39"/>
              <param name="CLOCK_ID" value="39"/>
            </parameters>
          </instance>
        </module>
        <module name="GPBR" id="6378" version="J">
          <instance name="GPBR">
            <register-group address-space="base" name="GPBR" name-in-module="GPBR" offset="0x400E1890"/>
